# Conflictive humans VS trouble maker sharks

In [1]:
#Imports 
import pandas as pd
import numpy as np
pd.options.display.max_rows = 999
#Import data
df_shark = pd.read_csv('output/sharks.csv', encoding='latin-1')
df_humans = pd.read_csv('output/humans.csv', encoding='latin-1')

## The most conflictive human

We are going the analyze the nationality, the gender and the preferred activity in the sea of the most conflictive human.
### Nationality

In [2]:
nationality = pd.DataFrame(df_humans.Country.value_counts())
# Show the top5
nationality.iloc[:5]

                  Country
USA                   182
AUSTRALIA             106
SOUTH AFRICA           42
NEW ZEALAND            15
PAPUA NEW GUINEA       12

### Gender

In [3]:
gender = pd.DataFrame(df_humans.Sex.value_counts())
gender

   Sex
M  455
F   21

### Activity

In [4]:
activity = pd.DataFrame(df_humans.Activity.value_counts())
# The top 5
activity.iloc[:5]

              Activity
Fishing            204
Spearfishing        61
Diving              15
Surfing             12
Swimming            12

## The most trouble maker shark

We want to determine the most agressive shark species in their respectives locations.

In [5]:
# Group the shark attacks by country, area and species
agrupados = (df_shark.groupby(["Country", "Area", "Species"])
            .agg({'Species': ['count']})
             # Sort values by multiindex column, showing only the top five values
            .sort_values([('Species', 'count')], ascending = False)[:5])
agrupados = agrupados.reset_index()
# SHow table
agrupados

        Country                   Area      Species
                                                    count
0           USA             California  White shark   154
1  SOUTH AFRICA  Western Cape Province  White shark    99
2           USA                 Hawaii  Tiger shark    83
3     AUSTRALIA        South Australia  White shark    41
4           USA                Florida   Bull shark    41